#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`
<details><summary>Show Plan</summary>

```

module.ecr.data.aws_ecr_lifecycle_policy_document.il101_ecr_default_policy: Reading...
module.ecr.data.aws_ecr_lifecycle_policy_document.il101_ecr_default_policy: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.il01_api_server_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "il01_api_server_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "This is the default policy. It will persist at most 5 tags."
                      + rulePriority = 1
                      + selection    = {
                          + countNumber    = 5
                          + countType      = "imageCountMoreThan"
                          + tagPatternList = [
                              + "latest",
                              + "*",
                            ]
                          + tagStatus      = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "il01/api_server"
    }

  # module.ecr.aws_ecr_repository.il01_api_server will be created
  + resource "aws_ecr_repository" "il01_api_server" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "il01/api_server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*